app/views/customers/destroy.js.erb

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 63]]
---
$('.delete_customer').bind('ajax:success', function() {
  $(this).closest('tr').fadeOut();
});