app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.all
---
SELECT "contracts".* FROM "contracts"

  def show
    @products = @contracts.products.all
---
SELECT "products".* FROM "products" WHERE "products"."contract_id" = ?  [["contract_id", 10]]

  def create
    @contract = Contract.new(contract_params)

    respond_to do |format|
      if @contract.save
---
INSERT INTO "contracts" ("date", "period", "interval", "fee", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?, ?)  [["date", Sun, 13 Nov 2016], ["period", 1], ["interval", 1], ["fee", 1], ["created_at", 2016-11-13 23:13:14 UTC], ["updated_at", 2016-11-13 23:13:14 UTC], ["name", "newContract"]]

  def update
    respond_to do |format|
      if @contract.update(contract_params)
---
UPDATE "contracts" SET "name" = ?, "period" = ?, "interval" = ?, "fee" = ?, "date" = ?, "updated_at" = ? WHERE "contracts"."id" = ?  [["name", "New Contract"], ["period", 1], ["interval", 1], ["fee", 1], ["date", Sun, 13 Nov 2016], ["updated_at", 2016-11-13 22:51:16 UTC], ["id", 29]]

  def destroy
    @contract.destroy
---
DELETE FROM "contracts" WHERE "contracts"."id" = ?  [["id", 26]]

    def set_contract
      @contract = Contract.find(params[:id])
---
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]