app/controllers/customers_controller.rb

SELECT "contracts".* FROM "contracts" WHERE "contracts"."customer_id" = ?  [["customer_id", 5]]
INSERT INTO "contracts" ("created_at", "updated_at", "name", "customer_id") VALUES (?, ?, ?, ?)  [["created_at", 2016-11-13 23:31:57 UTC], ["updated_at", 2016-11-13 23:31:57 UTC], ["name", "mööp"], ["customer_id", 10]]
---
  def show
    @contracts = @customer.contracts.all

    @contract = Contract.new(params[:contract])
    @contract.customer = @customer

    respond_to do |format|
      if @contract.save && @contract.name

INSERT INTO "customers" ("email", "created_at", "updated_at", "name", "address", "tax") VALUES (?, ?, ?, ?, ?, ?)  [["email", "post@anjakammer.de"], ["created_at", 2016-11-14 18:21:26 UTC], ["updated_at", 2016-11-14 18:21:26 UTC], ["name", "Anja Kammer"], ["address", "Hoffmannstr., 9"], ["tax", 5966989]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "Been Street 32"], ["updated_at", 2016-11-02 09:58:55 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)