app/controllers/features_controller.rb

SELECT "features".* FROM "features"
---
  def index
    @features = Feature.all