app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("item_name", "item_price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_name", "Book"], ["item_price", "100"], ["created_at", "2016-10-17 15:18:53.600257"], ["updated_at", "2016-10-17 15:18:53.600257"]]